{"resourceType":"ValueSet","id":"shr-core-CodingQualifierVS","text":{"status":"generated","div":"<div xmlns=\"http://www.w3.org/1999/xhtml\">\n<p><b>SHR CodingQualifierVS ValueSet</b></p>\n<p/>\n</div>"},"url":"http://standardhealthrecord.org/shr/core/vs/CodingQualifierVS","identifier":[{"system":"http://standardhealthrecord.org","value":"shr.core.CodingQualifierVS"}],"version":"0.0.1","name":"SHR CodingQualifierVS ValueSet","title":"SHR CodingQualifierVS ValueSet","status":"draft","date":"2017-12-20","publisher":"The MITRE Corporation: Standard Health Record Collaborative","contact":[{"telecom":[{"system":"url","value":"http://standardhealthrecord.org"}]}],"compose":{"include":[{"system":"http://standardhealthrecord.org/shr/core/cs/CodingQualifierCS","concept":[{"code":"preferred_code","display":"The preferred, standardized code for interoperability purposes. There should be only one coding in a CodeableConcept with this tag."},{"code":"source_code","display":"The code found in the information source for this entry, e.g., the raw, original, or first encoding."},{"code":"user_selected_code","display":"The code was directly selected by the user, as opposed to being determined after the fact via interpretation of notes or natural language processing."},{"code":"derived_code","display":"The code was determined after-the-fact from source data, either through translation, or via interpretation of free text (by human or machine)."},{"code":"category_code","display":"Indicates the code is a less specific term or a categorization of the source or standard code, i.e., a hypernym. For example, a code for 'vital sign' in the context of a body weight measurement would be a category code. Category codes can  be useful for search and query purposes."},{"code":"coded_expression","display":"The code is an expression in an expression language defined by the CodeSystem"},{"code":"default_code","display":"The code was supplied by the system by default, because no specific coded value was available."}]}]}}